code/Catalogs/Сотрудник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Сотрудник</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code/Catalogs/Сотрудник/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	Вывод();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	Вывод();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	Вывод();
КонецПроцедуры

Функция Вывод() 
	Если не ПустаяСтрока(Объект.Фамилия) и не ПустаяСтрока(Объект.Имя) тогда
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
		Конецесли;	
КонецФункции

&НаКлиенте
Процедура Зарегистроваться(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Файл = Новый Файл(ПутьКФайлу);
	Если Файл.Существует() Тогда 
		//Для передачи содержимого файла в серверную процедуру,
		//в которой возможна работа с хранилищем и запись объекта,
		//необходимо файл преобразовать в двоичные данные
		ДД = Новый ДвоичныеДанные(ПутьКФайлу);
		ЗагрузитьНаСервере(ДД);
		
		//Так как объект при загрузке будет записан, 
		//то снимаем признак модифицированности (отображается звёздочкой в заголовке формы)
		//Объект записывать не обязательно, 
		//но тогда необходимо обновлять отображение логотипа после записи объекта
		ЭтаФорма.Модифицированность = Ложь;
		ОбновитьЛоготип();
	Иначе
		Сообщить("Выберите файл картинки");
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьНаСервере(ДД)
	Хранилище = Новый ХранилищеЗначения(ДД);
	//Специфика работы с реквизитом формы объектном типа, заключается в том,
	//что нельзя работать полноценно с этим объектом для изменения и записи напрямую.
	//Для этого необходимо преобразовывать реквизит в значение, а затем обратно
	Об = РеквизитФормыВЗначение("Объект");
	Об.Логотип = Хранилище;
	Об.Записать();
	ЗначениеВРеквизитФормы(Об,"Объект");  		
КонецПроцедуры

&НаСервере
Процедура ОбновитьЛоготип()
	ЛоготипКартинка = ПоместитьВоВременноеХранилище(Объект.Ссылка.Логотип.Получить(), УникальныйИдентификатор);КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЛоготип();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	Парам = Новый Структура("КонтактноеЛицо, Телефон", Объект.КонтактноеЛицо, Объект.Телефон);
	ОткрытьФорму("РегистрСведений.Сообщения.ФормаЗаписи", Парам);
КонецПроцедуры


&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите картинку для загрузки";
	Диалог.Фильтр = "Рисунок JPG(*.jpg)|*.jpg|Рисунок PNG(*.png)|*.png"; 
	
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры
